## The Battle of Neighborhoods: London

### Clustering schools based on house price and the number of libraries and museums

In [1]:
import numpy as np # library to handle data in a vectorized manner

import pandas as pd 
# pd.set_option('display.max_columns', None)
# pd.set_option('display.max_rows', None)

import json # library to handle JSON files

from geopy.geocoders import Nominatim # convert an address into latitude and longitude values

import requests # library to handle requests
from pandas import json_normalize # tranform JSON file into a pandas dataframe

import matplotlib as mpl
import matplotlib.pyplot as plt
import matplotlib.cm as cm
# import matplotlib.colors as colors

# from sklearn.cluster import KMeans

import folium

from time import sleep

## Data preparation

### London boroughs

In [2]:
# read the information of London borough from wiki
url='https://en.wikipedia.org/wiki/List_of_London_boroughs'
London_data=pd.read_html(url)

In [3]:
# get the info of 32 Boroughs and the City of London
London_data[:2]

[                            Borough     Inner Status  \
 0     Barking and Dagenham [note 1]       NaN    NaN
 1                            Barnet       NaN    NaN
 2                            Bexley       NaN    NaN
 3                             Brent       NaN    NaN
 4                           Bromley       NaN    NaN
 5                            Camden       NaN    NaN
 6                           Croydon       NaN    NaN
 7                            Ealing       NaN    NaN
 8                           Enfield       NaN    NaN
 9                Greenwich [note 2]  [note 3]  Royal
 10                          Hackney       NaN    NaN
 11  Hammersmith and Fulham [note 4]       NaN    NaN
 12                         Haringey  [note 3]    NaN
 13                           Harrow       NaN    NaN
 14                         Havering       NaN    NaN
 15                       Hillingdon       NaN    NaN
 16                         Hounslow       NaN    NaN
 17                        Islington       NaN    NaN
 18           Kensington and Chelsea       NaN  Royal
 19             Kingston upon Thames       NaN  Royal
 20                          Lambeth       NaN    NaN
 21                         Lewisham       NaN    NaN
 22                           Merton       NaN    NaN
 23                           Newham  [note 3]    NaN
 24                        Redbridge       NaN    NaN
 25             Richmond upon Thames       NaN    NaN
 26                        Southwark       NaN    NaN
 27                           Sutton       NaN    NaN
 28                    Tower Hamlets       NaN    NaN
 29                   Waltham Forest       NaN    NaN
 30                       Wandsworth       NaN    NaN
 31                      Westminster       NaN   City

                                   Local authority           Political control  \
 0     Barking and Dagenham London Borough Council                      Labour
 1                   Barnet London Borough Council                Conservative
 2                   Bexley London Borough Council                Conservative
 3                    Brent London Borough Council                      Labour
 4                  Bromley London Borough Council                Conservative
 5                   Camden London Borough Council                      Labour
 6                  Croydon London Borough Council                      Labour
 7                   Ealing London Borough Council                      Labour
 8                  Enfield London Borough Council                      Labour
 9                Greenwich London Borough Council                      Labour
 10                 Hackney London Borough Council                      Labour
 11  Hammersmith and Fulham London Borough Council                      Labour
 12                Haringey London Borough Council                      Labour
 13                  Harrow London Borough Council                      Labour
 14                Havering London Borough Council  Conservative (council NOC)
 15              Hillingdon London Borough Council                Conservative
 16                Hounslow London Borough Council                      Labour
 17               Islington London Borough Council                      Labour
 18  Kensington and Chelsea London Borough Council                Conservative
 19    Kingston upon Thames London Borough Council            Liberal Democrat
 20                 Lambeth London Borough Council                      Labour
 21                Lewisham London Borough Council                      Labour
 22                  Merton London Borough Council                      Labour
 23                  Newham London Borough Council                      Labour
 24               Redbridge London Borough Council                      Labour
 25    Richmond upon Thames London Borough Council            Liberal Democrat
 26               Southwark London Borough Council                      Labour
 27                  Sutton London Borough Council            Liberal Democrat
 28           Tower Hamlets London Borough Council                      Labour
 29          Waltham Forest London Borough Council                      Labour
 30              Wandsworth London Borough Council                Conservative
 31                       Westminster City Council                Conservative

                                        Headquarters  Area (sq mi)  \
 0                          Town Hall, 1 Town Square         13.93
 1   North London Business Park, Oakleigh Road South         33.49
 2                   Civic Offices, 2 Watling Street         23.38
 3                 Brent Civic Centre, Engineers Way         16.70
 4                     Civic Centre, Stockwell Close         57.97
 5                     Camden Town Hall, Judd Street          8.40
 6               Bernard Weatherill House, Mint Walk         33.41
 7               Perceval House, 14-16 Uxbridge Road         21.44
 8                       Civic Centre, Silver Street         31.74
 9             Woolwich Town Hall, Wellington Street         18.28
 10                   Hackney Town Hall, Mare Street          7.36
 11                           Town Hall, King Street          6.33
 12                          Civic Centre, High Road         11.42
 13                       Civic Centre, Station Road         19.49
 14                             Town Hall, Main Road         43.35
 15                        Civic Centre, High Street         44.67
 16                      Hounslow House, 7 Bath Road         21.61
 17              Municipal Offices, 222 Upper Street          5.74
 18                    The Town Hall, Hornton Street          4.68
 19                           Guildhall, High Street         14.38
 20                  Lambeth Town Hall, Brixton Hill         10.36
 21                        Town Hall, 1 Catford Road         13.57
 22                        Civic Centre, London Road         14.52
 23              Newham Dockside, 1000 Dockside Road         13.98
 24                     Town Hall, 128-142 High Road         21.78
 25                     Civic Centre, 44 York Street         22.17
 26                                160 Tooley Street         11.14
 27                   Civic Offices, St Nicholas Way         16.93
 28      Town Hall, Mulberry Place, 5 Clove Crescent          7.63
 29            Waltham Forest Town Hall, Forest Road         14.99
 30            The Town Hall, Wandsworth High Street         13.23
 31        Westminster City Hall, 64 Victoria Street          8.29

     Population (2013 est)[1]                                 Co-ordinates  \
 0                     194352  51°33′39″N 0°09′21″E﻿ / ﻿51.5607°N 0.1557°E
 1                     369088  51°37′31″N 0°09′06″W﻿ / ﻿51.6252°N 0.1517°W
 2                     236687  51°27′18″N 0°09′02″E﻿ / ﻿51.4549°N 0.1505°E
 3                     317264  51°33′32″N 0°16′54″W﻿ / ﻿51.5588°N 0.2817°W
 4                     317899  51°24′14″N 0°01′11″E﻿ / ﻿51.4039°N 0.0198°E
 5                     229719  51°31′44″N 0°07′32″W﻿ / ﻿51.5290°N 0.1255°W
 6                     372752  51°22′17″N 0°05′52″W﻿ / ﻿51.3714°N 0.0977°W
 7                     342494  51°30′47″N 0°18′32″W﻿ / ﻿51.5130°N 0.3089°W
 8                     320524  51°39′14″N 0°04′48″W﻿ / ﻿51.6538°N 0.0799°W
 9                     264008  51°29′21″N 0°03′53″E﻿ / ﻿51.4892°N 0.0648°E
 10                    257379  51°32′42″N 0°03′19″W﻿ / ﻿51.5450°N 0.0553°W
 11                    178685  51°29′34″N 0°14′02″W﻿ / ﻿51.4927°N 0.2339°W
 12                    263386  51°36′00″N 0°06′43″W﻿ / ﻿51.6000°N 0.1119°W
 13                    243372  51°35′23″N 0°20′05″W﻿ / ﻿51.5898°N 0.3346°W
 14                    242080  51°34′52″N 0°11′01″E﻿ / ﻿51.5812°N 0.1837°E
 15                    286806  51°32′39″N 0°28′34″W﻿ / ﻿51.5441°N 0.4760°W
 16                    262407  51°28′29″N 0°22′05″W﻿ / ﻿51.4746°N 0.3680°W
 17                    215667  51°32′30″N 0°06′08″W﻿ / ﻿51.5416°N 0.1022°W
 18                    155594  51°30′07″N 0°11′41″W﻿ / ﻿51.5020°N 0.1947°W
 19                    166793  51°24′31″N 0°18′23″W﻿ / ﻿51.4085°N 0.3064°W
 20                    314242  51°27′39″N 0°06′59″W﻿ / ﻿51.4607°N 0.1163°W
 21                    286180  51°26′43″N 0°01′15″W﻿ / ﻿51.4452°N 0.0209°W
 22                    203223  51°24′05″N 0°11′45″W﻿ / ﻿51.4014°N 0.1958°W
 23                    318227  51°30′28″N 0°02′49″E﻿ / ﻿51.5077°N 0.0469°E
 24                    288272  51°33′32″N 0°04′27″E﻿ / ﻿51.5590°N 0.0741°E
 25                    191365  51°26′52″N 0°19′34″W﻿ / ﻿51.4479°N 0.3260°W
 26                    298464  51°30′13″N 0°04′49″W﻿ / ﻿51.5035°N 0.0804°W
 27                    195914  51°21′42″N 0°11′40″W﻿ / ﻿51.3618°N 0.1945°W
 28                    272890  51°30′36″N 0°00′21″W﻿ / ﻿51.5099°N 0.0059°W
 29                    265797  51°35′27″N 0°00′48″W﻿ / ﻿51.5908°N 0.0134°W
 30                    310516  51°27′24″N 0°11′28″W﻿ / ﻿51.4567°N 0.1910°W
 31                    226841  51°29′50″N 0°08′14″W﻿ / ﻿51.4973°N 0.1372°W

     Nr. in map
 0           25
 1           31
 2           23
 3           12
 4           20
 5           11
 6           19
 7           13
 8           30
 9           22
 10           9
 11           4
 12          29
 13          32
 14          24
 15          33
 16          14
 17          10
 18           3
 19          16
 20           6
 21          21
 22          17
 23          27
 24          26
 25          15
 26           7
 27          18
 28           8
 29          28
 30           5
 31           2  ,
           Borough      Inner                              Status  \
 0  City of London  ([note 5]  Sui generis;City;Ceremonial county

                                     Local authority Political control  \
 0  Corporation of London;Inner Temple;Middle Temple                 ?

   Headquarters  Area (sq mi)  Population(2011 est)  \
 0    Guildhall          1.12                  7000

                                   Co-ordinates  Nr. inmap
 0  51°30′56″N 0°05′32″W﻿ / ﻿51.5155°N 0.0922°W          1  ]

In [4]:
# Convert to dataframe 
Borough=pd.DataFrame(London_data[0])
City_of_London=pd.DataFrame(London_data[1])

# add city of London to Borough for convenience
Greater_London=Borough.append(City_of_London)

# reset index
Greater_London.reset_index(drop=True, inplace=True)

Greater_London.head()

,Borough,Inner,Status,Local authority,Political control,Headquarters,Area (sq mi),Population (2013 est)[1],Co-ordinates,Nr. in map,Population(2011 est),Nr. inmap
0,Barking and Dagenham [note 1],NaN,NaN,Barking and Dagenham London Borough Council,Labour,"Town Hall, 1 Town Square",13.93,194352.0,51°33′39″N 0°09′21″E﻿ / ﻿51.5607°N 0.1557°E,25.0,NaN,NaN
1,Barnet,NaN,NaN,Barnet London Borough Council,Conservative,"North London Business Park, Oakleigh Road South",33.49,369088.0,51°37′31″N 0°09′06″W﻿ / ﻿51.6252°N 0.1517°W,31.0,NaN,NaN
2,Bexley,NaN,NaN,Bexley London Borough Council,Conservative,"Civic Offices, 2 Watling Street",23.38,236687.0,51°27′18″N 0°09′02″E﻿ / ﻿51.4549°N 0.1505°E,23.0,NaN,NaN
3,Brent,NaN,NaN,Brent London Borough Council,Labour,"Brent Civic Centre, Engineers Way",16.70,317264.0,51°33′32″N 0°16′54″W﻿ / ﻿51.5588°N 0.2817°W,12.0,NaN,NaN
4,Bromley,NaN,NaN,Bromley London Borough Council,Conservative,"Civic Centre, Stockwell Close",57.97,317899.0,51°24′14″N 0°01′11″E﻿ / ﻿51.4039°N 0.0198°E,20.0,NaN,NaN

__clean data__

In [9]:
# get the list of boroughs
london_borough=Greater_London[['Borough']]

# edit the names of Borough, delete suffix [note #]
# get borough names with suffix
borough_with_suffix=london_borough['Borough'].str.contains('note')
for i, borough in london_borough[borough_with_suffix].iterrows():
    name_no_suffix=borough['Borough'][:-9]
    london_borough.loc[i,'Borough']=name_no_suffix

london_borough.head()

/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)
/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

                Borough
0  Barking and Dagenham
1                Barnet
2                Bexley
3                 Brent
4               Bromley

In [10]:
# Gathering the Latitude and Longitude coordinates for each borough using geolocater
for i in range(london_borough.shape[0]):
    borough=london_borough.loc[i,'Borough']
    address= borough + ',England'
    geolocator = Nominatim(user_agent="LDN_explorer")
    
    location = geolocator.geocode(address)
    
    latitude = location.latitude
    longitude = location.longitude        
    london_borough.loc[i,'Latitude']=latitude
    london_borough.loc[i,'Longitude']=longitude
    sleep(1)

london_borough.head()

/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/pandas/core/indexing.py:845: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[key] = _infer_fill_value(value)
/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/pandas/core/indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

                Borough   Latitude  Longitude
0  Barking and Dagenham  51.554117   0.150504
1                Barnet  51.653090  -0.200226
2                Bexley  51.441679   0.150488
3                 Brent  51.441635   0.234519
4               Bromley  51.402805   0.014814

In [57]:
# save file
london_borough.to_csv('London_borough_location.csv',index=False)

### House Price by Borough

In [11]:
filename='London-house-prices-borough.csv'

In [12]:
house_price=pd.read_csv(filename)
house_price.head()

        Code                  Area                  Year Measure    Value
0  E09000001        City of London  Year ending Dec 1995  Median  105,000
1  E09000002  Barking and Dagenham  Year ending Dec 1995  Median   49,000
2  E09000003                Barnet  Year ending Dec 1995  Median   85,125
3  E09000004                Bexley  Year ending Dec 1995  Median   62,000
4  E09000005                 Brent  Year ending Dec 1995  Median   68,000

In [13]:
house_price.shape

(12015, 5)

In [14]:
house_price.groupby('Measure').count()

         Code  Area  Year  Value
Measure
Mean     4005  4005  4005   4005
Median   4005  4005  4005   4005
Sales    4005  4005  4005   4005

We will use the Median and Mean house price at the end of each year from 1995 to 2017 for modeling and predicting

In [47]:
# select the year-end data
house_price_dec=house_price.loc[house_price['Year'].str.contains('Dec'),:]
house_price_dec.head()

        Code                  Area                  Year Measure    Value
0  E09000001        City of London  Year ending Dec 1995  Median  105,000
1  E09000002  Barking and Dagenham  Year ending Dec 1995  Median   49,000
2  E09000003                Barnet  Year ending Dec 1995  Median   85,125
3  E09000004                Bexley  Year ending Dec 1995  Median   62,000
4  E09000005                 Brent  Year ending Dec 1995  Median   68,000

In [48]:
# set column 'Year' to type int
Year=house_price_dec['Year'].str.split(' ',expand = True)

house_price_dec['YearEnd']=Year[3]

house_price_dec.head()

/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

,Code,Area,Year,Measure,Value,YearEnd
0,E09000001,City of London,Year ending Dec 1995,Median,"105,000",1995
1,E09000002,Barking and Dagenham,Year ending Dec 1995,Median,"49,000",1995
2,E09000003,Barnet,Year ending Dec 1995,Median,"85,125",1995
3,E09000004,Bexley,Year ending Dec 1995,Median,"62,000",1995
4,E09000005,Brent,Year ending Dec 1995,Median,"68,000",1995

In [49]:
# drop columns
house_price_dec.drop(columns=['Code','Year'],inplace=True)

# rename columns
house_price_dec.rename(columns={'Area':'Borough','Value':'Price'},inplace=True)

house_price_dec=house_price_dec.reset_index(drop=True)

/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,
/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [50]:
house_price_dec.head()

                Borough Measure    Price YearEnd
0        City of London  Median  105,000    1995
1  Barking and Dagenham  Median   49,000    1995
2                Barnet  Median   85,125    1995
3                Bexley  Median   62,000    1995
4                 Brent  Median   68,000    1995

In [53]:
# drop rows with borough not in the london_borough dataframe
local_index=[]
for index in range(0,house_price_dec.shape[0]):
    if house_price_dec['Borough'].iloc[index] not in london_borough['Borough'].tolist():
        local_index.append(index)

house_price_dec=house_price_dec.drop(local_index,axis=0)
house_price_dec.reset_index(drop=True, inplace=True)

print(house_price_dec.shape)
house_price_dec.head()

(2277, 4)

                Borough Measure    Price YearEnd
0        City of London  Median  105,000    1995
1  Barking and Dagenham  Median   49,000    1995
2                Barnet  Median   85,125    1995
3                Bexley  Median   62,000    1995
4                 Brent  Median   68,000    1995

In [54]:
# select median and mean value
house_price_median=house_price_dec.loc[house_price_dec['Measure']=='Median',:]
house_price_mean=house_price_dec.loc[house_price_dec['Measure']=='Mean',:].reset_index(drop=True)

In [55]:
house_price_median.head()

                Borough Measure    Price YearEnd
0        City of London  Median  105,000    1995
1  Barking and Dagenham  Median   49,000    1995
2                Barnet  Median   85,125    1995
3                Bexley  Median   62,000    1995
4                 Brent  Median   68,000    1995

In [56]:
print(house_price_mean.shape)
house_price_mean.head()

(759, 4)

                Borough Measure    Price YearEnd
0        City of London    Mean  146,043    1995
1  Barking and Dagenham    Mean   50,615    1995
2                Barnet    Mean  111,019    1995
3                Bexley    Mean   66,294    1995
4                 Brent    Mean   77,258    1995

In [58]:
# save file
house_price_median.to_csv('London_MedianHousePrice_borough_1995_2017.csv',index=False)
house_price_mean.to_csv('London_MeanHousePrice_borough_1995_2017.csv',index=False)

### Schools Atlas

In [22]:
file_school='all_schools.csv'
school=pd.read_csv(file_school)

In [23]:
school.head()

,OBJECTID,URN,SCHOOL_NAM,TYPE,PHASE,ADDRESS,TOWN,POSTCODE,STATUS,GENDER,...,LA_NAME,WEBLINK,AGE,map_icon,NEW_URN,OLD_URN,map_icon_l,Primary,x,y
0,1,135155,Ayesha Siddiqa Girls School,Other Independent School,Not applicable,165-169 The Broadway,Southall,UB1 1LR,Open,Girls,...,Ealing,,19-Nov,,,,2,0,-0.378496,51.507500
1,2,140492,Beis Medrash Elyon,Other Independent School,Not applicable,233 West Hendon Broadway,London,NW9 7DG,Open,Boys,...,Barnet,,16-Nov,,,,2,0,-0.241628,51.578999
2,3,141411,Big Creative Independent School,Other Independent School,Not applicable,Silver Birch House,Walthamstow,E17 5SD,Open,Mixed,...,Waltham Forest,,15 - 16,,,,2,0,-0.042590,51.594002
3,4,142336,Wetherby Senior School,Other Independent School,Not applicable,100 Marylebone Lane,London,W1U 2QB,Open,Boys,...,Westminster,,16-Nov,,,,2,0,-0.150409,51.517601
4,5,100042,St Mary's Kilburn Church of England Primary Sc...,Voluntary Aided School,Primary,Quex Road,London,NW6 4PG,Open,Mixed,...,Camden,http://www.stmarykilburn.camden.sch.uk/,11-Mar,VOLUNTARY,,,2,1,-0.193367,51.540402

In [24]:
# select name, addresses, boroughs, towns, postcodes and location coordinates as school_data
school_data=school[['SCHOOL_NAM', 'ADDRESS', 'TOWN', 'LA_NAME','POSTCODE']]

school_data['Latitude']=school[['y']]
school_data['Longitude']=school[['x']]

print(school_data.shape)
school_data.head()

(3889, 7)

/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/Users/wangyifei/opt/anaconda3/envs/Cousera_learning/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

,SCHOOL_NAM,ADDRESS,TOWN,LA_NAME,POSTCODE,Latitude,Longitude
0,Ayesha Siddiqa Girls School,165-169 The Broadway,Southall,Ealing,UB1 1LR,51.507500,-0.378496
1,Beis Medrash Elyon,233 West Hendon Broadway,London,Barnet,NW9 7DG,51.578999,-0.241628
2,Big Creative Independent School,Silver Birch House,Walthamstow,Waltham Forest,E17 5SD,51.594002,-0.042590
3,Wetherby Senior School,100 Marylebone Lane,London,Westminster,W1U 2QB,51.517601,-0.150409
4,St Mary's Kilburn Church of England Primary Sc...,Quex Road,London,Camden,NW6 4PG,51.540402,-0.193367

In [28]:
# drop rows with boroughs that are not in the london_borough dataframe
local_index = []
for index in range(0,school_data.shape[0]):
    if school_data['LA_NAME'].iloc[index] not in london_borough['Borough'].tolist():
        local_index.append(index)

school_data=school_data.drop(local_index, axis=0)
school_data.reset_index(drop=True, inplace=True)

print(school_data.shape)
school_data.head()

(3372, 7)

,SCHOOL_NAM,ADDRESS,TOWN,LA_NAME,POSTCODE,Latitude,Longitude
0,Ayesha Siddiqa Girls School,165-169 The Broadway,Southall,Ealing,UB1 1LR,51.507500,-0.378496
1,Beis Medrash Elyon,233 West Hendon Broadway,London,Barnet,NW9 7DG,51.578999,-0.241628
2,Big Creative Independent School,Silver Birch House,Walthamstow,Waltham Forest,E17 5SD,51.594002,-0.042590
3,Wetherby Senior School,100 Marylebone Lane,London,Westminster,W1U 2QB,51.517601,-0.150409
4,St Mary's Kilburn Church of England Primary Sc...,Quex Road,London,Camden,NW6 4PG,51.540402,-0.193367

In [59]:
# save file
school_data.to_csv('London_school_location.csv',index=False)

__Load Data for analysis__